// Для постэффектов используем большой треугольник вместо fullscreen quad.
// Генерируем вершины прямо в шейдере (CCW), вершинный буфер не требуется.
// https://wallisc.github.io/rendering/2021/04/18/Fullscreen-Pass.html

#version 450

layout(location = 0) out vec2 out_uv;

void main()
{
    // Генерируем координаты UV:
    // 0: (0.0, 0.0) — верхний левый угол экрана
    // 1: (0.0, 2.0) - нижний левый угол (за пределами экрана)
    // 2: (2.0, 0.0) — верхний правый угол (за пределами экрана)
    out_uv = vec2(gl_VertexIndex & 2, (gl_VertexIndex << 1) & 2);

    // Генерируем координаты вершин:
    // 0: (-1.0, -1.0) — верхний левый угол экрана
    // 1: (-1.0, 3.0) - нижний левый угол (за пределами экрана)
    // 2: (3.0, -1.0) - верхний правый угол (за пределами экрана)
    gl_Position = vec4(out_uv * 2.0 - 1.0, 0.0, 1.0);
}
