#pragma once

#include "ecs_common.hpp"


// ===================== Компоненты =====================

struct CEnemy
{
    // Увеличенный коллайдер у врагов, чтобы игроку было легче по ним попадать.
    // Обычный коллайдер увеличивать нельзя - игрок будет легче сталкиваться с врагами
    Collider hitbox = Collider::zero;
};

// Дрон-камикадзе стремится врезаться в игрока
struct CDrone
{
    // Время жизни корабля (в наносекундах).
    // Влияет на поведение
    u64 lifetime = 0;
};

// Истребитель стреляет лазером вниз
struct CFighterMarker
{
};

// Ганшип стреляет плазмой в сторону игрока
struct CGunshipMarker
{
};

// ===================== Системы =====================

// Дроны могут менять направление движения
void s_update_drone_velocities(u64 ns);

void s_draw_enemies();
void s_draw_enemy_hitboxes();
